/**
*   ************************************************************************************
*                               普芯达电子有限公司
*                               www.chipswinner.com
*   ************************************************************************************
*   @Demo   Version     V1.0.0.0
*   @Date               2018.7.26
*   ************************************************************************************
**/
/***************************************************************************************
*                                    模块性能介绍
*   1、MCU提供10/12位ADC检测，拥有8路外部输入通道以及2路内部输入通道
*   2、参考电压可选择内部Vref（VDD、2V、3V、4V）以及外部Vref，转换后的数据可选择数据位
*      数和对齐方向
*   ************************************************************************************
*                                    应用注意事项
*   1、在掉电模式下，ADCEN强制为0，ADC失能。
*   2、为保证ADC转换精度，建议ADC转换时钟频率在2MHz及2MHz以下。
*   3、内部参考电压选择2V时，VDD工作电压须高于2.7V。内部参考电压选择3V/4V时，VDD工作电
*      压须高于内部参考电压0.5V以上。
*   4、启动ADC转换时，需要关闭ADC省电唤醒功能。使能ADC模块或者切换通道后，为保证精度建
*      议延时一段时间在启动转换，延时时间在15us左右。
*   5、启动转换时，ADCIF需要先软件清0，ADCIF位为1时，置ADCST不能启动新的转换。在转换过
*      程中，若ADCST位软件清0将终止转换。
*   6、在进行内部通道选择时，外部通道选择XCHS[3:0]应配置为1111，否则可能会造成内部通道
*      和外部通道同时打开的情况。
*   7、AD采集推挽输出切换为模拟输入以后需要延时一段时间，具体时间根据实际情况计算，IO口
*      无负载，由推挽输出切换为模拟输入建议延时5us。
*   8、芯片进入掉电模式时不可以将ADCC0中的INREF_S寄存器设置为VDD电压，否则会增加大概70uA
*      的电流。
***************************************************************************************/

/**************************************************************************************/
#define _ADC_
#include "adc.h"
#include "gpio.h"
/**************************************************************************************/



/***************************************************************************************
* @功能 单次采样
* @说明
* @参数
* @返回值 单次采样结果
* @注
***************************************************************************************/
static u16 Adc_SingleValue(void)
{
    //启动ADC转换
    ADCC0 |= AD_ADCST;

    //等待ADC转换结束
    while(!(ADCC0 & AD_ADCIF));

    //清除标志位
    ADCC0 &= ~AD_ADCIF;
    //返回采样值
    return ADCR;
}
/**************************************************************************************/

/***************************************************************************************
* @功能 获取多次AD采样值
* @说明
* @参数
* @返回值 u16_adc_one_value平均值
* @注   定周期调用一次函数获取一次采样值, 累计多次采样值后去掉最大最小值求平均,得到采样结果
***************************************************************************************/
void Adc_Sample_Cycle(void)
{
    u8 i;
    u16 min, max;
    u32 sum;

    u16_adc_value_buf[u8_adc_times] = Adc_SingleValue();
    u8_adc_times++;

    if(u8_adc_times >= D_ADC_TOTAL_TIMES)
    {
        //多次采样结束,计算采样结果
        u8_adc_times = 0;
        //去掉最大值和最小值求取平均
        sum = 0;
        min = u16_adc_value_buf[0];
        max = u16_adc_value_buf[0];

        for(i = 0; i < D_ADC_TOTAL_TIMES; i++)
        {
            if(u16_adc_value_buf[i] > max)
            {
                max = u16_adc_value_buf[i];
            }

            if(u16_adc_value_buf[i] < min)
            {
                min = u16_adc_value_buf[i];
            }

            sum += u16_adc_value_buf[i];
        }

        sum = sum - min - max;
        u16_adc_value = sum / D_ADC_VALID_TIMES;
    }
}
/**************************************************************************************/


/***************************************************************************************
* @功能 上电配置ADC寄存器
* @说明
* @参数
* @返回值
* @注
***************************************************************************************/
void Adc_Config_PowerOn(void)
{
    //配置P20[AN8]为模拟输入
    P2M0 = (P2M0 & 0xF0) | IOL_ANALOG_IN;
    //打开ADC模块电压,内部VDD参考电压
    ADCC0 = AD_ADCEN | AD_INREF_VDD;
    //外部通道8
    ADCC1 = AD_XCHS_AIN8;
    //ADC数据12位右对齐,ADC时钟1M(系统时钟32M/32)
    ADCC2 = AD_12B_H4L8 | AD_ADCTS_CLK21M | AD_CLK_FOSC32;
}
/**************************************************************************************/


/***************************************************************************************
* @功能 掉电配置ADC寄存器
* @说明
* @参数
* @返回值
* @注
***************************************************************************************/
void Adc_Config_PowerDown(void)
{
    //关闭ADC模块电源
    ADCC0 = 0;
}
/**************************************************************************************/


/***************************************************************************************
* @功能 AD采样相关暂存值初始化
* @说明
* @参数
* @返回值
* @注
***************************************************************************************/
void Adc_Buffer_Initail(void)
{
    u8_adc_times = 0;
    u16_adc_value = 0;
}
/**************************************************************************************/
